In [1]:
import pandas as pd

In [7]:
 df1=pd.DataFrame({'name':['vinu','vivek'],'rollno':[12,23]})
 df2=pd.DataFrame({'name':['vishnu','vrindha'],'rollno':[34,45]})
 df3=pd.DataFrame({'batch':['BCA','MCA'],'location':['ekm','tsr']})

In [8]:
df1

    name  rollno
0   vinu      12
1  vivek      23

In [9]:
df2

      name  rollno
0   vishnu      34
1  vrindha      45

In [10]:
df3

  batch location
0   BCA      ekm
1   MCA      tsr

## concat()

The concat() function takes two or more DataFrames as arguments and returns a new DataFrame that combines them.
df=pd.concat([df1,df2])

In [11]:
df=pd.concat([df1,df2])
df

      name  rollno
0     vinu      12
1    vivek      23
0   vishnu      34
1  vrindha      45

In [12]:
df=pd.concat([df1,df2],ignore_index=True)
df

      name  rollno
0     vinu      12
1    vivek      23
2   vishnu      34
3  vrindha      45

-->By default (axis=0), it combines the rows of the DataFrames one below the other (row-wise concatenation).
-->When you use axis=1, concat() combines the DataFrames side by side (column-wise).

In [15]:
df5=pd.concat([df1,df2],axis=1)
df5

    name  rollno     name  rollno
0   vinu      12   vishnu      34
1  vivek      23  vrindha      45

In [16]:
df5=pd.concat([df1,df3],axis=1)
df5

    name  rollno batch location
0   vinu      12   BCA      ekm
1  vivek      23   MCA      tsr

In [17]:
df6=pd.concat([df1,df3])
df6

    name  rollno batch location
0   vinu    12.0   NaN      NaN
1  vivek    23.0   NaN      NaN
0    NaN     NaN   BCA      ekm
1    NaN     NaN   MCA      tsr

In [19]:
df7=pd.concat([df1,df2,df3])
df7

      name  rollno batch location
0     vinu    12.0   NaN      NaN
1    vivek    23.0   NaN      NaN
0   vishnu    34.0   NaN      NaN
1  vrindha    45.0   NaN      NaN
0      NaN     NaN   BCA      ekm
1      NaN     NaN   MCA      tsr

In [20]:
df7=pd.concat([df1,df2,df3],axis=1)
df7

    name  rollno     name  rollno batch location
0   vinu      12   vishnu      34   BCA      ekm
1  vivek      23  vrindha      45   MCA      tsr

## merge()

Merging two datasets is the process of combining them into one by aligning rows from each dataset based on common attributes (columns).

In [21]:

df1 = pd.DataFrame({
    'empid': [101, 102, 103, 104, 105],
    'empname': ['Anand', 'bavish', 'catherine', 'davis', 'elias'],
    'designation': ['doctor', 'engineer', 'advocate', 'teacher', 'developer']})

In [22]:
df1

   empid    empname designation
0    101      Anand      doctor
1    102     bavish    engineer
2    103  catherine    advocate
3    104      davis     teacher
4    105      elias   developer

In [23]:
df2 = pd.DataFrame({
    'empid': [101, 102, 103, 106, 107],
    'salary': [20000, 20300, 30000, 23000, 27000],
    'location': ['ern', 'kollam', 'thrissur', 'aluva', 'cherthala']})
df2

   empid  salary   location
0    101   20000        ern
1    102   20300     kollam
2    103   30000   thrissur
3    106   23000      aluva
4    107   27000  cherthala

df.merge(left df,right df,how=MergeHow,on=Column or index level names to join on)

## inner merge()

-->Returns a DataFrame with only those rows that have common values in the join column(s).
-->It requires that each row in the two DataFrames have matching column values in the specified key(s).
-->If there is no match, the row is excluded from the result.

In [25]:
df=pd.merge(df1,df2,how='inner',on='empid')
df

   empid    empname designation  salary  location
0    101      Anand      doctor   20000       ern
1    102     bavish    engineer   20300    kollam
2    103  catherine    advocate   30000  thrissur

## outer merge

In [ ]:
-->Keeps all rows from both DataFrames.
-->Fills NaN for missing matches on either side.

In [26]:
df=pd.merge(df1,df2,how='outer',on='empid')
df

   empid    empname designation   salary   location
0    101      Anand      doctor  20000.0        ern
1    102     bavish    engineer  20300.0     kollam
2    103  catherine    advocate  30000.0   thrissur
3    104      davis     teacher      NaN        NaN
4    105      elias   developer      NaN        NaN
5    106        NaN         NaN  23000.0      aluva
6    107        NaN         NaN  27000.0  cherthala

## right merge

-->Keeps every row from the right DataFrame.
-->Rows in the right DataFrame that do not have matching values in the left DataFrame will have NaN in columns from the left.

In [27]:
df=pd.merge(df1,df2,how='right',on='empid')
df

   empid    empname designation  salary   location
0    101      Anand      doctor   20000        ern
1    102     bavish    engineer   20300     kollam
2    103  catherine    advocate   30000   thrissur
3    106        NaN         NaN   23000      aluva
4    107        NaN         NaN   27000  cherthala

## left merge

-->Keeps every row from the left DataFrame.
-->Rows in the left DataFrame that do not have matching values in the right DataFrame will have NaN in columns from the right.

In [28]:
df=pd.merge(df1,df2,how='left',on='empid')
df

   empid    empname designation   salary  location
0    101      Anand      doctor  20000.0       ern
1    102     bavish    engineer  20300.0    kollam
2    103  catherine    advocate  30000.0  thrissur
3    104      davis     teacher      NaN       NaN
4    105      elias   developer      NaN       NaN